Ran Plan for dir: `terraform/iam/zerone-id` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.5.7 plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/DevopsArtFactory/terraform-provisioning/26/default/terraform/iam/zerone-id/iam::zerone-id-default.tfplan\" -var 'assume_role_arn=arn:aws:iam::066346343248:role/atlantis-zerone-id-admin'" in "/home/atlantis/.atlantis/repos/DevopsArtFactory/terraform-provisioning/26/default/terraform/iam/zerone-id": exit status 1
data.aws_iam_policy_document.codebuild_deployment_operation_document: Reading...
aws_iam_openid_connect_provider.gitaction_idp: Refreshing state... [id=arn:aws:iam::066346343248:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.assume_id_admin_pass_role: Reading...
data.aws_iam_policy_document.codebuild_deployment_assume_role_document: Reading...
aws_iam_group.devops_black: Refreshing state... [id=devops_black]
data.aws_iam_policy_document.assume_id_admin_assume_role: Reading...
data.aws_iam_policy_document.gitaction_ecr: Reading...
data.aws_iam_policy_document.gitaction_assume_role_document: Reading...
module.sops_zerone_id.aws_iam_role.secure: Refreshing state... [id=zerond-id-secure-sops]
module.sops_zerone_id.aws_iam_role.common: Refreshing state... [id=zerond-id-sops]
data.aws_iam_policy_document.codebuild_deployment_operation_document: Read complete after 0s [id=3751647917]
data.aws_iam_policy_document.assume_id_admin_pass_role: Read complete after 0s [id=4184222603]
data.aws_iam_policy_document.assume_id_admin_assume_role: Read complete after 0s [id=3351616110]
data.aws_iam_policy_document.gitaction_ecr: Read complete after 0s [id=1752591292]
data.aws_iam_policy_document.gitaction_assume_role_document: Read complete after 0s [id=35836956]
data.aws_iam_policy_document.codebuild_deployment_cloudwatch_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_assume_role_document: Read complete after 0s [id=1229436035]
data.aws_iam_policy_document.gitaction_ecs: Reading...
data.aws_iam_policy_document.codebuild_deployment_ecr_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_cloudwatch_document: Read complete after 0s [id=242181265]
data.aws_iam_policy_document.gitaction_ecs: Read complete after 0s [id=43735964]
aws_iam_user.zerone: Refreshing state... [id=zerone]
aws_iam_role.gitaction: Refreshing state... [id=gitaction]
data.aws_iam_policy_document.codebuild_deployment_ecr_document: Read complete after 0s [id=482158191]
aws_iam_group_policy_attachment.devops_black: Refreshing state... [id=devops_black-20241003031651070700000001]
aws_iam_group_membership.devops_black: Refreshing state... [id=devops_black]
module.sops_zerone_id.aws_iam_role_policy.secure-passrole: Refreshing state... [id=zerond-id-secure-sops:zerond-id-secure-sops-passrole]
module.sops_zerone_id.aws_iam_role_policy.common-passrole: Refreshing state... [id=zerond-id-sops:zerond-id-sops-passrole]
aws_iam_role_policy.gitaction_ecr: Refreshing state... [id=gitaction:gitaction-ecr]
aws_iam_role_policy.gitaction_ecs: Refreshing state... [id=gitaction:gitaction-ecs]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_instance_profile.codebuild_deployment will be created
  + resource "aws_iam_instance_profile" "codebuild_deployment" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "codebuild-deployment-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "codebuild-deployment"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.assume_id_admin will be created
  + resource "aws_iam_role" "assume_id_admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066346343248:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "assume-id-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codebuild_deployment will be created
  + resource "aws_iam_role" "codebuild_deployment" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-deployment"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.assume_id_admin_passrole will be created
  + resource "aws_iam_role_policy" "assume_id_admin_passrole" {
      + id          = (known after apply)
      + name        = "assume-id-admin-passrole"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_cloudwatch will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_cloudwatch" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:066346343248:log-group:/aws/codebuild/*:*",
                          + "arn:aws:logs:*:066346343248:log-group:/aws/codebuild/*",
                          + "arn:aws:logs:*:066346343248:log-group:/*:*:*",
                          + "arn:aws:logs:*:066346343248:log-group:/*:*",
                          + "arn:aws:logs:*:066346343248:log-group:/*",
                          + "arn:aws:logs:*:066346343248:log-group:*:*:*/*",
                        ]
                      + Sid      = "AllowCloudWatchAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_ecr will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_ecr" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                  + {
                      + Action   = [
                          + "sts:GetServiceBearerToken",
                          + "ecr:GetAuthorizationToken",
                          + "ecr-public:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_operation will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_operation" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-operation-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:SendCommand",
                          + "ssm:ListCommandInvocations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SSMSendCommand"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudwatchAccess"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentELBAccess"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentIAMAccess"
                    },
                  + {
                      + Action   = "ec2:CreateNetworkInterfacePermission"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ap-northeast-2:066346343248:network-interface/*"
                    },
                  + {
                      + Action   = [
                          + "ec2:ModifyLaunchTemplate",
                          + "ec2:GetLaunchTemplateData",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DeleteLaunchTemplateVersions",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateLaunchTemplateVersion",
                          + "ec2:CreateLaunchTemplate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "LaunchTemplates"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeDhcpOptions",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentVPCAccess"
                    },
                  + {
                      + Action   = "autoscaling:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentASGAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVolume*",
                          + "ec2:DeleteVolume",
                          + "ec2:CreateVolume",
                          + "ec2:AttachVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentVolumeAccess"
                    },
                  + {
                      + Action   = "ec2:DescribeKeyPairs"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentKeyPairAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:TerminateInstances",
                          + "ec2:StopInstances",
                          + "ec2:StartInstances",
                          + "ec2:RunInstances",
                          + "ec2:RebootInstances",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentInstanceAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeSnapshots",
                          + "ec2:CreateSnapshot",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentSnapshotAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:RegisterImage",
                          + "ec2:DescribeImages",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentAMIAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentSecurityGroupAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.assume_id_admin will be created
  + resource "aws_iam_role_policy_attachment" "assume_id_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + codebuild_deployment_arn              = (known after apply)
  + codebuild_deployment_instance_profile = (known after apply)

Error: Invalid backend configuration

  with data.terraform_remote_state.kms,
  on remote_state.tf line 4, in data "terraform_remote_state" "kms":
   4:   config = merge(var.remote_state.kms.zerone-id, {"assume_role" = {"role_arn" = var.assume_role_arn}})

The given configuration is not valid for backend "s3": unexpected attribute
"assume_role".

```
</details>

